package com.example.administrator.ewmarket.app.engine;

import android.content.ContentValues;
import android.database.sqlite.SQLiteDatabase;

import com.example.administrator.ewmarket.R;
import com.example.administrator.ewmarket.app.db.MyTourInformationOpenHelper;

/**
 * Created by Administrator on 2017/1/5 0005.
 */

public class InitTourInformation
{
    public static void initData( MyTourInformationOpenHelper tourInformationOpenHelper)
    {
        SQLiteDatabase db = tourInformationOpenHelper.getWritableDatabase();
        if (db.isOpen())
        {
            ContentValues values1 = new ContentValues();
            values1.put("itemid","item1");
            values1.put("tourname", "上海-苏州-乌镇-杭州高铁4日游");
            values1.put("icon", R.mipmap.item1);
            values1.put("startplace", "天津");
            values1.put("destination", "乌镇");
            values1.put("price", "￥1330起");
            values1.put("tour1content", "纯玩0购物，全程不换车导，门票全含，含苏杭双游船，赏古镇夜景");
            values1.put("tour2content", "牛人专线纯玩无购物住宿可升级乌镇夜色尽享纯玩0购物专业导游");
            values1.put("upremark", 0);
            values1.put("downremark", 0);
            values1.put("detailcontent","    江南是水做的，四季弥漫的水汽使生活在这里的人变得滋润。在水乡，人们最“惬意”的两件事，一是“皮包水”，二是“水包皮”。这句俏皮话的意思是指去浴室洗澡和到茶馆喝茶，可见喝茶是渗透到水乡人骨子里的一种享受。每天清晨，江南水乡的风情韵致就在这袅袅的水烟中迷醉般展开,历史上，乌镇茶馆最多的时候有六十几家，地处中市的访卢阁、三益楼、常春楼、一洞天、明月楼、天韵楼等规模较大，档次也高，茶客的身份也尊贵些；而分散在东南西北四栅的小茶馆，主顾都是四乡里来镇上做买卖的农民。两者各有各的特点，前者俗称街庄，雅致些，但要说起水乡的原汁原味、质朴醇厚来，后者（俗称乡庄）更贴近些。乡庄只做上午，街庄常做下午。最负盛名的“访卢阁”茶馆不仅出现在文学大师茅盾的笔下，而且被传说成茶圣陆羽两次造访茶馆老板卢仝而得名.茶馆之所以经历千百年离乱盛世而不衰，自有它作为生活基本的一面，茶客有的是做完了早市才进茶馆，与围桌而坐的茶客随意攀谈；有的是一进早市就钻进茶馆，买卖在临街的茶桌旁交易，一边悠闲地喝着茶，一边不紧不慢地讨价还价。在信息传播落后的年代，茶馆是信息交流和处理公众事务的重要场所。一个茶馆便是一个小镇的“新华社”，各种消息都在这里发布；大至长江洪水，小至李家小孩吵夜，近如阿大捉螃蟹反被螃蟹咬……现在村村都有广播、电视、录音机，但茶客还是喜欢到茶馆里唠山海经，即便是新兴的咖啡馆、舞厅也没能冲击它的存在。");
            values1.put("costcontent","费用包含\n" +
                    "交通\n" +
                    "往返团队/散客机票含税费（团队机票将统一出票，散客机票因实时计价预定后即刻出票）\n" +
                    "当地旅游巴士\n" +
                    "往返船票(鼓浪屿轮渡往返船票)\n" +
                    "住宿\n" +
                    "行程所列酒店。\n" +
                    "用餐\n" +
                    "行程中团队标准用餐，5早1正，正餐餐标25元/人。鼓浪屿上酒店无早餐提供，为了您的方便，我们为您安排的是简易早餐（中式餐或自助餐或特色餐，自由活动期间用餐请自理；如因自身原因放弃用餐，则餐费不退）。\n" +
                    "导服");
            db.insert("tourInformation", null, values1);

            ContentValues values2 = new ContentValues();
            values2.put("itemid","item2");
            values2.put("tourname", "横店影视城广州街-香港街-明清宫苑-清明上河图-秦王宫2日游");
            values2.put("icon",R.mipmap.item2);
            values2.put("startplace", "杭州");
            values2.put("destination", "秦王宫");
            values2.put("price", "￥594起");
            values2.put("tour1content", "含4点联票 宿三星商务酒店，含早，体验穿越情怀");
            values2.put("tour2content", "牛人专线");
            values2.put("upremark", 0);
            values2.put("downremark", 0);
            values2.put("detailcontent","    横店影视城秦王宫景区是1997年为著名导演陈凯歌拍摄历史巨片《荆柯刺秦王》而建。占地面积800亩，建筑面积达11万平方米。有雄伟壮观的王宫宝殿27座，主宫\"四海归一殿\" 高达44.8米，面积17169平方米。长2289米，高18米的巍巍城墙与王宫大殿交相辉映，淋漓尽致地表现出秦始皇并吞六国，一统天下的磅礴气势。还有一条长 120米，占地面积20亩，建筑面积6000平方米的\"秦汉街\"，充分展示了秦汉时期的街肆风貌。黄尘古道，金戈铁马，燕赵建筑，秦汉文化，在秦王宫得以真实再现。也是著名电影《英雄》、《功夫之王》等大片的诞生地。当年陈凯歌团队中的设计师们花费了四年心血设计出了一幅宏伟的秦王宫蓝图，而秦王宫景区仿建的原型就是秦王朝最主要的宫殿--咸阳宫。\n" +
                    "\n" +
                    "    在这里，还曾经拍摄完成了《寻秦记》、《汉武大帝》、《无极》、《美人心计》、《木乃伊:龙帝之墓》《古剑奇谭》《天将雄师》《兰陵王》《陆贞传奇》《芈月传》《卫子夫》《秦时明月》《武媚娘传奇》《天天有喜》《蜀山战纪》《武神赵子龙》《乱世枭雄》等500余部影视作品。");
            values2.put("costcontent","费用包含\n" +
                    "交通\n" +
                    "往返团队/散客机票含税费（团队机票将统一出票，散客机票因实时计价预定后即刻出票）\n" +
                    "当地旅游巴士\n" +
                    "往返船票(鼓浪屿轮渡往返船票)\n" +
                    "住宿\n" +
                    "行程所列酒店。\n" +
                    "用餐\n" +
                    "行程中团队标准用餐，5早1正，正餐餐标25元/人。鼓浪屿上酒店无早餐提供，为了您的方便，我们为您安排的是简易早餐（中式餐或自助餐或特色餐，自由活动期间用餐请自理；如因自身原因放弃用餐，则餐费不退）。\n" +
                    "导服");
            db.insert("tourInformation", null, values2);


            ContentValues values3 = new ContentValues();
            values3.put("itemid","item3");
            values3.put("tourname", "[元旦]安徽九华山祈福观光高铁2日跟团游");
            values3.put("icon",R.mipmap.item3);
            values3.put("startplace", "天津");
            values3.put("destination", "安徽九华山");
            values3.put("price", "￥1499起");
            values3.put("tour1content", "高铁往返 全景祈福 ，含门票、交通、当地导游服务 宿山上1晚聚龙大酒店， 领九华山开光佛珠");
            values3.put("tour2content", "牛人专线纯玩无购物聚龙大酒店门票交通全含赠佛珠");
            values3.put("upremark", 0);
            values3.put("downremark", 0);
            values3.put("detailcontent","    九华山是佛教名山，在历史上，僧尼格于戒律，禁食荤腥，只能吃斋；而当地，一来信徒众多，二来官府也禁止山民和来此的香客游人食荤，长久以来，这里大部分以吃素为主，逐渐形成了独具特色、盛名在外的九华素斋。\n" +
                    "九华山素斋风味属于寺院素斋系。后运用现代烹饪技艺，南北风味为一体，结合九华山地方特色，将当地野菜、山珍、土菜等引入素斋，形成如今的九华“素食”。\n" +
                    "    素食主要取材于本山出产的黄精、百合、石耳、木耳、竹笋、黄花菜、胡萝卜等蔬菜，配以豆腐、面筋、素油，或清炒、或火煨、或清炖、或烘烤，一般不加佐料调色调味，以清淡为本色，可制作100多个品种。菜肴香、脆、鲜、嫩，因不着酱料香辛，别有一番清新、澹然的意境，且营养丰富，久食不腻。\n" +
                    "    虽然是素菜，但多起一些荤菜名，颇有些从俗的意思，且价格较贵。佛家名菜主要有“红烧石鸡”、“清蒸山凤凰\"、“凤凰烧鸡”、“天台双冬”、“冰山雪球”、“双龙戏珠”、“佛珠肉”、“素全鱼”、“素鸡”、“素香肠”、“九华三耳”（木耳、石耳、银耳）、“天台双冬”、“纯鲜扣菇”、“石耳肉汤”、“红烧四鲜”等。\n" +
                    "二十世纪三十年代后，荤禁松驰，除佛教徒和朝山进香者在寺庙里严格食素外，一般游客和当地山民已不受素食限制，九华山荤菜馆在九华街一带逐渐增加，另九华山风景区各大宾馆和街头路旁也分布有素餐馆都能品尝到当地风味的各种素菜。");
            values3.put("costcontent","费用包含\n" +
                    "交通\n" +
                    "往返团队/散客机票含税费（团队机票将统一出票，散客机票因实时计价预定后即刻出票）\n" +
                    "当地旅游巴士\n" +
                    "往返船票(鼓浪屿轮渡往返船票)\n" +
                    "住宿\n" +
                    "行程所列酒店。\n" +
                    "用餐\n" +
                    "行程中团队标准用餐，5早1正，正餐餐标25元/人。鼓浪屿上酒店无早餐提供，为了您的方便，我们为您安排的是简易早餐（中式餐或自助餐或特色餐，自由活动期间用餐请自理；如因自身原因放弃用餐，则餐费不退）。\n" +
                    "导服");
            db.insert("tourInformation", null, values3);

            ContentValues values4 = new ContentValues();
            values4.put("itemid","item4");
            values4.put("tourname", "高铁度假时代-宁波万达索菲特大酒店-恒元温泉2日游");
            values4.put("icon", R.mipmap.item4);
            values4.put("startplace", "天津");
            values4.put("destination", "恒元温泉");
            values4.put("price", "￥1507起");
            values4.put("tour1content", "宿宁波万达索菲特大酒店，约泡五星恒元二灵山温泉");
            values4.put("tour2content", "牛人专线高铁出行，比跟…");
            values4.put("upremark", 0);
            values4.put("downremark", 0);
            values4.put("detailcontent","    宁波万达索菲特大饭店地处鄞州新区，毗邻大型购物中心万达广场，与都市商业区的繁华和现代相得益彰。这座国际五星级酒店的风格吸纳了法兰西的烂漫情怀和中国的古典文雅，并与甬城深厚的旅游文化相融合。宁波万达索菲特大饭店拥有290间豪华客房和套房。每个房间都拥有高清液晶电视、高速互联网、无线电话、私人保险箱，以及全方位的互动娱乐设施。酒店还设有3间风格现代、设施齐全的会议厅，配有最先进的视频音频设备和无线网络系统。与会议厅搭配的还有6间风味独特的餐厅。寓意“极致”的乐味轩-地中海摩登餐厅，宾客可在古典音乐的优雅里享受精致的地中海菜肴、沙拉和餐后甜品。在“和风”特色的日本餐馆，可以品尝到地道的日式料理。为专业人士、外籍人士以及住店客人打造的乐吧（红酒+雪茄），极具爵士韵味。酒店另有1间豪华宴会厅，无论是婚庆宴请、小型私人派对或大型鸡尾酒会，宁波万达索菲特大饭店都将为您呈现最好的品质。不仅如此，酒店还拥有室内恒温游泳池和专业Spa服务，为追求健康和休闲的宾客提供最完美的体验.");
            values4.put("costcontent","费用包含\n" +
                    "交通\n" +
                    "往返团队/散客机票含税费（团队机票将统一出票，散客机票因实时计价预定后即刻出票）\n" +
                    "当地旅游巴士\n" +
                    "往返船票(鼓浪屿轮渡往返船票)\n" +
                    "住宿\n" +
                    "行程所列酒店。\n" +
                    "用餐\n" +
                    "行程中团队标准用餐，5早1正，正餐餐标25元/人。鼓浪屿上酒店无早餐提供，为了您的方便，我们为您安排的是简易早餐（中式餐或自助餐或特色餐，自由活动期间用餐请自理；如因自身原因放弃用餐，则餐费不退）。\n" +
                    "导服");
            db.insert("tourInformation", null, values4);

            ContentValues values5 = new ContentValues();
            values5.put("itemid","item5");
            values5.put("tourname", "西塘古镇2日游");
            values5.put("icon",R.mipmap.item5);
            values5.put("startplace", "上海");
            values5.put("destination", "西塘古镇");
            values5.put("price", "￥315起");
            values5.put("tour1content", "全程纯玩不购物，宿景区内莲溪素玉堂精品客栈，赏魅惑夜景");
            values5.put("tour2content", "牛人专线体验水乡生活感受夜间狂欢美食休闲之旅");
            values5.put("upremark", 0);
            values5.put("downremark", 0);
            values5.put("detailcontent","    西塘虽是一个小镇，但它许多带有乡土风味的美食却能让游客回味良久。水乡的餐饮以水产为主，肉嵌鲫鱼、红烧鳗鲤、馄饨鸭、炒鳝腐、清蒸白丝鱼、塘鲤鱼、湖蟹，味道鲜美。\n" + "各种当地风味小吃，如八珍糕、千层饼、水豆腐等，既下酒又可作点心。尤其值得一提的是荷叶粉蒸肉，滑软爽口，香而不腻，肉香从镬中飘出，弥漫在街巷中，久久不散。");
            values5.put("costcontent","费用包含\n" +
                    "交通\n" +
                    "往返团队/散客机票含税费（团队机票将统一出票，散客机票因实时计价预定后即刻出票）\n" +
                    "当地旅游巴士\n" +
                    "往返船票(鼓浪屿轮渡往返船票)\n" +
                    "住宿\n" +
                    "行程所列酒店。\n" +
                    "用餐\n" +
                    "行程中团队标准用餐，5早1正，正餐餐标25元/人。鼓浪屿上酒店无早餐提供，为了您的方便，我们为您安排的是简易早餐（中式餐或自助餐或特色餐，自由活动期间用餐请自理；如因自身原因放弃用餐，则餐费不退）。\n" +
                    "导服");
            db.insert("tourInformation", null, values5);

            ContentValues values6 = new ContentValues();
            values6.put("itemid","item6");
            values6.put("tourname", "杭州西湖-宋城-黄龙洞1日游");
            values6.put("icon",R.mipmap.item6);
            values6.put("startplace", "上海");
            values6.put("destination", "黄龙洞");
            values6.put("price", "￥152起");
            values6.put("tour1content", "纯玩无购物，追寻G20的脚步去探索藏在西湖里的美妙景观");
            values6.put("tour2content", "牛人专线回味无穷美妙景观G20");
            values6.put("upremark", 0);
            values6.put("downremark", 0);
            values6.put("detailcontent","    穿越千年的历史长河，一座从画中搬下来的古城，“给我一天，还你千年”，从良渚之光到宋宫宴舞，再到岳飞抗金的金戈铁马，西子传说、魅力杭州，宋城以独特的歌舞形式再现了宋城的历史变迁\n" +
                    "费用包含：\n" +
                    "1、交通：往返空调旅游巴士。\n" +
                    "2、门票：景点首道大门票（船游西湖、宋城、黄龙洞）。\n" +
                    "3、导服：全程导游服务费。\n" +
                    "4、儿童：1.2米以下儿童，仅包含车位、导游服务，其余自理。");
            values6.put("costcontent","费用包含\n" +
                    "交通\n" +
                    "往返团队/散客机票含税费（团队机票将统一出票，散客机票因实时计价预定后即刻出票）\n" +
                    "当地旅游巴士\n" +
                    "往返船票(鼓浪屿轮渡往返船票)\n" +
                    "住宿\n" +
                    "行程所列酒店。\n" +
                    "用餐\n" +
                    "行程中团队标准用餐，5早1正，正餐餐标25元/人。鼓浪屿上酒店无早餐提供，为了您的方便，我们为您安排的是简易早餐（中式餐或自助餐或特色餐，自由活动期间用餐请自理；如因自身原因放弃用餐，则餐费不退）。\n" +
                    "导服");
            db.insert("tourInformation", null, values6);

            ContentValues values7 = new ContentValues();
            values7.put("itemid","item7");
            values7.put("tourname", "知性西塘风情2日游");
            values7.put("icon",R.mipmap.item7);
            values7.put("startplace", "上海");
            values7.put("destination", "西塘");
            values7.put("price", "￥275起");
            values7.put("tour1content", "宿景区内极具设计感客栈，名师设计，知性，悠闲，赏魅惑夜景，全程纯玩不购物");
            values7.put("tour2content", "牛人专线体验水乡生活感受夜间狂欢美食休闲之旅");
            values7.put("upremark", 0);
            values7.put("downremark", 0);
            values7.put("detailcontent",
                    "★线路特色：\n" +
                    "1.全程没有购物安排 ，到了西塘，你爱怎么玩怎么玩。\n" +
                    "2.住宿安排为景区内的客栈，免去了你二次入园的烦恼，早上起来可以在西塘内吃上一顿热腾腾的早餐，也是蛮爽的。\n" +
                    "3.为你安排优秀西塘导游，让你更好的了解西塘的风土人情\n" +
                    "4.赶快来西塘，嗨起来吧！\n" +
                    "★温馨提示：\n" +
                    "西塘文艺游览方式：\n" +
                    "1、望江喝茶晒太阳 2、安静书吧里读书 3、漫步清晨六点小巷 4、寻找小店里一见钟情的首饰物 5、坐一只船水游古镇 6、不要错过西塘古街的晚霞 7、心无杂念的发呆\n" +
                    "吃货一族游览方式：\n" +
                    "1、管老太臭豆腐 2、荷叶粉蒸肉 3、森林芡实糕 4、各种水产，如肉嵌鲫鱼、红烧鳗鲤、馄饨鸭、炒鳝腐、清蒸白丝鱼、塘鲤鱼、湖蟹\n" +
                    "活力一族游览方式：\n" +
                    "1、酒吧街狂欢，夜晚的西塘退去白天安静的面纱，换上活力的一面，游人们也随着酒吧的歌手和音乐，尽情的狂欢 2、在河边放河灯，祈福许愿");
            values7.put("costcontent","费用包含\n" +
                    "交通\n" +
                    "往返团队/散客机票含税费（团队机票将统一出票，散客机票因实时计价预定后即刻出票）\n" +
                    "当地旅游巴士\n" +
                    "往返船票(鼓浪屿轮渡往返船票)\n" +
                    "住宿\n" +
                    "行程所列酒店。\n" +
                    "用餐\n" +
                    "行程中团队标准用餐，5早1正，正餐餐标25元/人。鼓浪屿上酒店无早餐提供，为了您的方便，我们为您安排的是简易早餐（中式餐或自助餐或特色餐，自由活动期间用餐请自理；如因自身原因放弃用餐，则餐费不退）。\n" +
                    "导服");
            db.insert("tourInformation", null, values7);

            ContentValues values8 = new ContentValues();
            values8.put("itemid","item8");
            values8.put("tourname", "上海迪士尼乐园+普陀山3日半自助游");
            values8.put("icon",R.mipmap.item8);
            values8.put("startplace", "上海");
            values8.put("destination", "普陀山");
            values8.put("price", "￥894起");
            values8.put("tour1content", "仅含往返大巴、精装农家客栈、迪士尼、普陀山大门票 住宿可自选升级");
            values8.put("tour2content", "牛人专线");
            values8.put("upremark", 0);
            values8.put("downremark", 0);
            values8.put("detailcontent","    上海迪士尼乐园(Shanghai Disney Resort)，又称上海迪士尼魔法王国主题乐园，位于中华人民共和国上海市浦东新区川沙新镇，是上海国际旅游度假区内的标志性景区，是中国大陆第一个，世界第六个迪士尼主题乐园。\n" +
                    "\n" +
                    "    迪士尼乐园一直是全球建造成本最高的主题乐园之一。上海迪士尼乐园占地963英亩，大概是美国佛罗里达奥兰多迪士尼世界的1/26。\n" +
                    "\n" +
                    "    上海迪士尼于2016年6月16日正式开门迎客，并举办为期数日的盛大开幕庆典。\n" +
                    "\n" +
                    "基本信息\n" +
                    "    还没有走进上海迪士尼乐园的大门，游客可能就会被一碧绿水池所吸引。这是上海迪士尼项目特别建造的一个面积达40万平方米的人工湖，这也许是迪士尼历史上最大的水景平台。据说，今后这里将经营游船业务，游客可以在水上观赏迪士尼浪漫的烟火表演。");
            values8.put("costcontent","费用包含\n" +
                    "交通\n" +
                    "往返团队/散客机票含税费（团队机票将统一出票，散客机票因实时计价预定后即刻出票）\n" +
                    "当地旅游巴士\n" +
                    "往返船票(鼓浪屿轮渡往返船票)\n" +
                    "住宿\n" +
                    "行程所列酒店。\n" +
                    "用餐\n" +
                    "行程中团队标准用餐，5早1正，正餐餐标25元/人。鼓浪屿上酒店无早餐提供，为了您的方便，我们为您安排的是简易早餐（中式餐或自助餐或特色餐，自由活动期间用餐请自理；如因自身原因放弃用餐，则餐费不退）。\n" +
                    "导服");
            db.insert("tourInformation", null, values8);

            ContentValues values9= new ContentValues();
            values9.put("itemid","item9");
            values9.put("tourname", "篁岭3日游");
            values9.put("icon",R.mipmap.item9);
            values9.put("startplace", "上海");
            values9.put("destination", "篁岭");
            values9.put("price", "￥1580起");
            values9.put("tour1content", "独家安排两晚入住婺源民宿月亮湾俞家大院 （16人VIP小包）");
            values9.put("tour2content", "立减牛人专线");
            values9.put("upremark", 0);
            values9.put("downremark", 0);
            values9.put("detailcontent","    婺源篁(huáng)岭景区，地处石耳山脉，面积15平方公里，由索道空\n" +
                    "篁岭晒秋人家\n" +
                    "篁岭晒秋人家 中揽胜、村落晒秋访古、梯田花海寻芳及乡风民俗拾趣等游览区域组合而成。 篁岭属典型山居村落，民居围绕水口呈扇形梯状错落排布。篁岭因\"晒秋\"闻名遐迩，村落\"天街\"似玉带将精典古建串接，徽式商铺林立，前店后坊，一幅流动的缩写版\"清明上河图\"。 周边千棵古树环抱、万亩梯田簇拥，四季花海展示惊艳的\"大地艺术\"。 独特的民俗文化体验带您走过索桥、滑过溜索、乘上高空索道，俯瞰独特的晒秋奇观。\n" +
                    "\n" +
                    "    美术、摄影及影视创作基地--篁岭晒秋人家\"欢迎您!");
            values9.put("costcontent","费用包含\n" +
                    "交通\n" +
                    "往返团队/散客机票含税费（团队机票将统一出票，散客机票因实时计价预定后即刻出票）\n" +
                    "当地旅游巴士\n" +
                    "往返船票(鼓浪屿轮渡往返船票)\n" +
                    "住宿\n" +
                    "行程所列酒店。\n" +
                    "用餐\n" +
                    "行程中团队标准用餐，5早1正，正餐餐标25元/人。鼓浪屿上酒店无早餐提供，为了您的方便，我们为您安排的是简易早餐（中式餐或自助餐或特色餐，自由活动期间用餐请自理；如因自身原因放弃用餐，则餐费不退）。\n" +
                    "导服");
            db.insert("tourInformation", null, values9);

            ContentValues values10= new ContentValues();
            values10.put("itemid","item10");
            values10.put("tourname", "[圣诞]大明山滑雪-黄山醉温泉-西递古村落2日游");
            values10.put("icon", R.mipmap.item10);
            values10.put("startplace", "南京");
            values10.put("destination", "西递古村落");
            values10.put("price", "￥538起");
            values10.put("tour1content", "含3小时滑雪畅划套票 宿醉温泉度假村 含挂牌1600项目 0购物 圣诞首班 浪漫来袭");
            values10.put("tour2content", "牛人专线3小时大明山畅…醉温泉全含冰火两重天");
            values10.put("upremark", 0);
            values10.put("downremark", 0);
            values10.put("detailcontent","    初雪的时候，所有的谎言都可以被原谅 雪花烂漫的季节，我带上你，你带上钱，一个背包，一台单反，一个会拍照的爱人和一颗说走就走旅行的心，那便是我认为的最好的生活方式。只需要一颗安静的心和不停的脚步，不停地遇见，不停地思考，不停地更新自己的记忆。走过一个又一个陌生的城市，去感受旖旎的自然风光，抛开尘世的纷扰，远离城市的喧嚣，寻找一份宁静，奢侈地享受旅不问人，行随己意的潇洒。\n" +
                    "    五星的口碑 高人气的销量 性价比爆棚惊人 \n" +
                    "    性价比指数  能享受到门票全含，五星体验！\n" +
                    "    我们的行程：大明山挂牌价值1000元3小时套票+价值238元的醉温泉温泉+104元西递的门票+价值挂牌500/间的醉温泉度假村，含车导，总价值约2000元的冬季2日游，带你玩翻这个冬季！\n" +
                    "    我们的优势：1小时滑雪，让你只短暂的享受滑雪的快乐，3小时滑雪让你有足够的时间去体验和畅玩。\n" +
                    "    我们的态度：对于每个报途牛牛人专线的客人，我们将会为您赠送1瓶矿泉水，占床客人赠早餐\n" +
                    "    我们的服务：全程途牛自选牛人导游，为您提供专业的服务，如果遇到牛人导游您不满意的，也可以跟我们提出建议，我们会根据每一位客户的建议来加强我们对导游的规范，我们希望与您共同进步。\n" +
                    " 履行赠送\n" +
                    "1、赠送价值238元醉温泉门票一张+价值500元/间醉温泉度假村票一张。含3小时滑雪套票一张（元旦春节节假日只含1小时滑雪）。\n" +
                    "2、含挂牌四星酒店早餐一份。（占床含早）\n" +
                    "2、牛牛精心为每位贵宾贴 准备了一瓶纯净水。矿泉水每人一瓶。");
            values10.put("costcontent","费用包含\n" +
                    "交通\n" +
                    "往返团队/散客机票含税费（团队机票将统一出票，散客机票因实时计价预定后即刻出票）\n" +
                    "当地旅游巴士\n" +
                    "往返船票(鼓浪屿轮渡往返船票)\n" +
                    "住宿\n" +
                    "行程所列酒店。\n" +
                    "用餐\n" +
                    "行程中团队标准用餐，5早1正，正餐餐标25元/人。鼓浪屿上酒店无早餐提供，为了您的方便，我们为您安排的是简易早餐（中式餐或自助餐或特色餐，自由活动期间用餐请自理；如因自身原因放弃用餐，则餐费不退）。\n" +
                    "导服");
            db.insert("tourInformation", null, values10);


            db.close();
        }
    }
}
